def area(a, b):
    '''
    Возвращает площадь прямоугольника.
    
            Параметры:
                    a (double): длина прямоугольника
                    b (double): ширина прямоугольника
    
            Возвращаемое значение:
                    area (double): площадь прямоугольника
            
            Пример:
                    >>> area(10, 20)
                    200
    '''    
    return a * b

def perimeter(a, b):
    '''
    Возвращает периметр прямоугольника.
    
            Параметры:
                    a (double): длина прямоугольника
                    b (double): ширина прямоугольника
    
            Возвращаемое значение:
                    perimeter (double): периметр прямоугольника
            
            Пример:
                    >>> perimeter(10, 20)
                    60
    '''   
    return 2 * (a + b)
