def area(a):
    '''
    Возвращает площадь квадрата.
    
            Параметры:
                    a (double): длина стороны квадрата
    
            Возвращаемое значение:
                    area (double): площадь квадрата

            Пример:
                    >>> area(10)
                    100
    '''    
    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата.
    
            Параметры:
                    a (double): длина стороны квадрата
    
            Возвращаемое значение:
                    perimeter (double): периметр квадрата
                
            Пример:
                    >>> perimeter(10)
                    40
    '''    
    return 4 * a
