def area(a, h):
    '''
    Возвращает площадь треугольника.

            Параметры:
                    a (double): длина стороны треугольника
                    h (double): длина высоты треугольника, опущенная из вершины на сторону длины a

            Возвращаемое значение:
                    area (double): площадь треугольника

            Пример:
                    >>> area(10, 20)
                    100
    '''
    return a * h / 2
def perimeter(a, b, c):
    '''
    Возвращает периметр треугольника.
    
            Параметры:
                    a (double): длина первой стороны треугольника
                    b (double): длина второй стороны треугольника
                    c (double): длина третьей стороны треугольника
    
            Возвращаемое значение:
                    perimeter (double): периметр треугольника

            Пример:
                    >>> perimeter(10, 20, 30)
                    60
    '''
    return a + b + c